### Report for deductions-cross-account

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- ci_roles in iam-ci
- environment_roles in iam-environment
- environment_strict_roles in iam-strict-environment
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 3.0"...
- Installing hashicorp/aws v3.76.1...
- Installed hashicorp/aws v3.76.1 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan (3 to add, 0 to change, 0 to destroy)</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_secretsmanager_secret.dockerhub_ecr_ptc will be created
  + resource "aws_secretsmanager_secret" "dockerhub_ecr_ptc" {
      + arn                            = (known after apply)
      + description                    = "Docker Hub creds for ECR pull-through cache"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "ecr-pullthroughcache/dockerhub"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)

      + replica (known after apply)

      + rotation_rules (known after apply)
    }

  # aws_secretsmanager_secret_policy.dockerhub_ecr_ptc will be created
  + resource "aws_secretsmanager_secret_policy" "dockerhub_ecr_ptc" {
      + id         = (known after apply)
      + policy     = (known after apply)
      + secret_arn = (known after apply)
    }

  # aws_secretsmanager_secret_version.dockerhub_ecr_ptc will be created
  + resource "aws_secretsmanager_secret_version" "dockerhub_ecr_ptc" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>